In [12]:
import pandas as pd
import numpy as np

In [13]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [14]:
df1['viewers'] = ["Sushmita", "Adam", "Benny", "Anurag"]
df2['users'] = ["Adam", "Anurag", "Benny", "Sushmita", "Apoorva"]

In [15]:
df1 = df1.assign(views = [31.2,17.9,265.23,42.47]) 
df2 = df2.assign(cost = [20,np.nan, 15, 2, 7])

In [16]:
df1.head()

    viewers   views
0  Sushmita   31.20
1      Adam   17.90
2     Benny  265.23
3    Anurag   42.47

In [17]:
df2.head()

      users  cost
0      Adam  20.0
1    Anurag   NaN
2     Benny  15.0
3  Sushmita   2.0
4   Apoorva   7.0

In [18]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left") 
df.head()

    viewers   views     users  cost
0  Sushmita   31.20  Sushmita   2.0
1      Adam   17.90      Adam  20.0
2     Benny  265.23     Benny  15.0
3    Anurag   42.47    Anurag   NaN

In [19]:
df=df.fillna(df.mean())

In [20]:
df['Gender'] = ["Female", "Male", "Male", "Female"]

In [21]:
df

    viewers   views     users       cost  Gender
0  Sushmita   31.20  Sushmita   2.000000  Female
1      Adam   17.90      Adam  20.000000    Male
2     Benny  265.23     Benny  15.000000    Male
3    Anurag   42.47    Anurag  12.333333  Female

In [22]:
df['Gender']=df['Gender'].map({"Female":"F","Male":"M"})

In [23]:
df

    viewers   views     users       cost Gender
0  Sushmita   31.20  Sushmita   2.000000      F
1      Adam   17.90      Adam  20.000000      M
2     Benny  265.23     Benny  15.000000      M
3    Anurag   42.47    Anurag  12.333333      F

In [25]:
df.groupby('Gender')['cost'].sum()

Gender
F    14.333333
M    35.000000
Name: cost, dtype: float64

In [26]:
df.set_index(['viewers'], inplace = True)

In [27]:
df.head()

           views     users       cost Gender
viewers
Sushmita   31.20  Sushmita   2.000000      F
Adam       17.90      Adam  20.000000      M
Benny     265.23     Benny  15.000000      M
Anurag     42.47    Anurag  12.333333      F

In [28]:
df.loc[['Adam','Anurag'],['cost','views']]

              cost  views
viewers
Adam     20.000000  17.90
Anurag   12.333333  42.47

In [29]:
df=pd.DataFrame({'Currency': pd.Series(['USD','EUR','GBP']),'ValueInINR': pd.Series([70, 89, 99])})

df.head()

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99

In [30]:
import copy
df1 = df.copy(deep=True)

In [31]:
df1.head()

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99

In [32]:
df.drop(['Currency'],axis=1)

   ValueInINR
0          70
1          89
2          99

In [33]:
pd.DataFrame.from_dict({'Currency': ['USD','EUR','GBP'],'ValueInINR':[70, 89, 99]})

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99